package java15;

import java15.config.JDBSConnection;
import java15.entity.Customer;
import java15.service.CustomerService;
import java15.service.Impl.CustomerServiceImpl;

/**
 * Hello world!
 *
 */
public class App 
{
    public static void main( String[] args )
    {
        CustomerService customerService = new CustomerServiceImpl();
//        customerService.createTable();
//        System.out.println(customerService.add(new Customer("Adilet", "Jumabekov", 702029560)));
//        System.out.println(customerService.getCostumerById(3L));
//        System.out.println(customerService.updatePhone(1L, 999888777));
//        System.out.println(customerService.delete(2L));
//        System.out.println(customerService.searchCostumerByName("Adilet"));

        System.out.println(customerService.sortCustomerByName());

//        Simple Queries:
//        Бардык продукталарды аттары жана баасы менен алыңыз. Получить все продукты с их названиями и ценами.
//        select p.productName , p.price from products p
//        Кардарлар таблицасынан бардык уникалдуу өлкөлөрдү алыңыз. Перечислите все уникальные страны из таблицы клиентов.
//        SELECT distinct c.city  FROM Customers c;
//            Буйрутма(orders) таблицанын ичинен 10- строкадан баштап 20 буйрутманы алыңыз. Получите 20 заказов из 10-й строки таблицы заказов.
//        select * from orders OFFSET 10 limit 20;
//            Белгилүү бир датага берилген буйрутмаларды алыңыз. (2024-01-13) Получить заказы, размещенные на определенную дату.

//            ID боюнча 1, 10, 4, 17 кардарларды табыңыз Найти клиентов 1, 10, 4, 17 по идентификатору

//        Aggregate Queries:
//        Продукциянын орточо баасын эсептөө: Рассчитаем среднюю цену продукции:

//        Буйрутма берилген продукциянын максималдуу санын табыңыз. (orderDetails) Найдите максимальное количество заказанной продукции.

//        Буйрутмалардан түшкөн жалпы кирешени алыңыз. (orderDetails) Получите общий доход, полученный от заказов.

//        Ар бир категориядагы продукталардын санын эсептеңиз. Подсчитайте количество товаров в каждой категории.

//        Кызматкерлердин орточо жашын эсептеңиз.(employees) Рассчитаем средний возраст сотрудников.

//        Subqueries:
//        3төн ашык заказ берген кардарлардын тизмеси. Список клиентов, разместивших более 3 заказов.

//            Орточо баадан жогору болгон товарларды алыңыз. Получить товары с ценами выше средней цены.

//            Эң көп буйрутма алган кызматкерди табыңыз. (orders, employees) Найдите сотрудника с наибольшим количеством заказов.

//        Белгилүү бир кардар тарабынан берилген буйрутмаларды алыңыз ( ID 3 менен кардар). Получите заказы, размещенные конкретным клиентом (клиентом с идентификатором 3).

//        Эч кандай буйрутма бербеген кардарлардын тизмеси. Список клиентов, которые не разместили заказов:

//        Join Queries:
//        Кардар(customers) маалыматы менен буйрутмалардын(orders) тизмесин алыңыз. Получить список заказов с информацией о клиенте.

//            Товарларды категорияларынын аталыштары менен бирге чыгарып алыңыз. Получите продукты вместе с названиями их категорий.

//            Буйрутманын(orders) IDсин , продуктанын атын жана заказ болгон продукталардын санын алыныз. Получите идентификатор заказа, название продукта и количество заказанных продуктов.

//            Кызматкерлерди алар аткарган буйрутмалардын саны менен алыңыз. Получить сотрудников с количеством заказов, которые они обработали:

//        Поставщиктерди(supplier) жана алардын продукталарын баасы менен алыныз. Список поставщиков с их продукцией и ценами

    }
}
